import random as r
#● ┌ ─ ┐ │ └ ┘
d={1:"┌ ─ ─ ─ ─ ─ ─ ─ ┐\n"
     "│  ●            │\n"
     "│               │\n"
     "│               │\n"
     "│               │\n"
     "│               │\n"
     "└─ ─ ─ ─ ─ ─ ─ ─┘\n",
   2:"┌ ─ ─ ─ ─ ─ ─ ─ ┐\n"
     "│  ●            │\n"
     "│               │\n"
     "│               │\n"
     "│               │\n"
     "│             ● │\n"
     "└─ ─ ─ ─ ─ ─ ─ ─┘\n",
   3:"┌ ─ ─ ─ ─ ─ ─ ─ ┐\n"
     "│  ●            │\n"
     "│               │\n"
     "│        ●      │\n"
     "│               │\n"
     "│             ● │\n"
     "└─ ─ ─ ─ ─ ─ ─ ─┘\n",
   4:"┌ ─ ─ ─ ─ ─ ─ ─ ┐\n"
     "│  ●         ●  │\n"
     "│               │\n"
     "│               │\n"
     "│               │\n"
     "│  ●          ● │\n"
     "└─ ─ ─ ─ ─ ─ ─ ─┘\n",
   5:"┌ ─ ─ ─ ─ ─ ─ ─ ┐\n"
     "│  ●         ●  │\n"
     "│               │\n"
     "│       ●       │\n"
     "│               │\n"
     "│  ●          ● │\n"
     "└─ ─ ─ ─ ─ ─ ─ ─┘\n",
   6:"┌ ─ ─ ─ ─ ─ ─ ─ ┐\n"
     "│  ●          ● │\n"
     "│               │\n"
     "│  ●          ● │\n"
     "│               │\n"
     "│  ●          ● │\n"
     "└─ ─ ─ ─ ─ ─ ─ ─┘\n",}

while True:
    print("-"*50)
    print("Computer threw a die , Guess it!!!")
    choice=int(input("Enter your guess, Enter '0' to stop :"))
    if choice==0:
        print("Thank you for playing")
        break
    elif choice in [1,2,3,4,5,6]:
        L=list(d)
        ran=r.choice(L)
        if choice==ran:
            print("-"*50)
            print(d[ran])
            print("You Won")
        else:
            print("-"*50)
            print("You Lost")
            print(d[ran])
    else:
        print("Enter Valid Choice")


